---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrooveRoughness
source: html/56659bee-f984-287b-944e-b236f70aacca.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodGrooveRoughness Property

The property labeled "Roughness for surface groove area" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodGrooveRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".